Repository: taku0/lambda_ja
Catalog: lambda_ja-level1.tmx
Source language: en_us
Languages: ja

source: Returns whether any elements of this stream match the provided predicate.
ja: このストリームのある要素が与えられた述語に適合するか返す。

source: Returns whether no elements of this stream match the provided predicate.
ja: このストリームのどの要素も与えられた述語に適合しないか返す。

source: Returns whether this stream, if a terminal operation were to be executed, would execute in parallel.
ja: このストリームが実行された際に並列に実行されるかどうかを返す。

source: See Non-Interference for more details.
ja: 詳細は非干渉性を参照せよ。

source: See the class documentation for {@link Stream} and the package documentation for java.util.stream for additional specification of streams, stream operations, stream pipelines, and parallelism, which governs the behavior of all stream types.
ja: 全てのストリーム型の挙動を規定する、更なるストリームの仕様・処理・ストリームパイプライン・並列性については{@link Stream}のクラスドキュメントとjava.util.streamのパッケージドキュメントを参照せよ。

source: See the class documentation for {@link Stream} and the package documentation for java.util.stream for additional specification of streams, stream operations, stream pipelines, and parallelism.
ja: 更なるストリームの仕様・処理・ストリームパイプライン・並列性については{@link Stream}のクラスドキュメントとjava.util.streamのパッケージドキュメントを参照せよ。

source: Short-circuiting operations such as {@code limit(n)} or {@code findFirst()} can allow computations on infinite streams to complete in finite time.
ja: {@code limit(n)}や{@code findFirst()}といった短絡的処理を使うと無限のストリームに対する計算が有限の時間で終わるようにできる。

source: Side-effects
ja: 副作用

source: Side-effects in behavioral parameters to stream operations are, in general, discouraged, as they can often lead to unwitting violations of the statelessness requirement, as well as other thread-safety hazards.
ja: 副作用があると状態を持たないという要件を無意識的に破ってしまいがちであり、また他のスレッド安全性に関する危険要因ともなるからである。

source: Similarly, operations that are intrinsically tied to encounter order, such as {@code limit()}, may require buffering to ensure proper ordering, undermining the benefit of parallelism.
ja: 同様に、{@code limit()}などのように本質的に出現順と結び付けられている処理は正しい順序を保障するためにバッファリングが必要となる場合があり、並列性の利点を損なう場合がある。

source: Since the list was modified before the terminal {@code collect} operation commenced the result will be a string of "one two three".
ja: リストは末端の{@code collect}処理が開始する前に変更されたので、結果は文字列"one two three"となる。

source: Since the supplier is only invoked after the terminal operation commences, any modifications to the source up to the start of the terminal operation are reflected in the stream result.
ja: 供給関数は末端処理が開始した後にのみ呼ばれるため、データ源に対する末端処理の開始までの全ての変更は結果のストリームに反映される。

source: So far, all the stream examples have used methods like {@link java.util.Collection#stream()} or {@link java.util.Arrays#stream(Object[])} to obtain a stream.
ja: これまでのストリームの全ての例ではストリームを得るのに{@link java.util.Collection#stream()}や{@link java.util.Arrays#stream(Object[])}といったメソッドを利用していた。

source: So we can evaluate {@code (a op b)} in parallel with {@code (c op d)}, and then invoke {@code op} on the results.
ja: つまり{@code (a op b)}を{@code (c op d)}と並列に評価し、その後その結果に{@code op}を適用できる。

source: Some examples include:
ja: 一部の例としては、次のような方法が挙げられる。

source: Some intermediate operations, such as {@code sorted()}, may impose an encounter order on an otherwise unordered stream, and others may render an ordered stream unordered, such as {@link java.util.stream.BaseStream#unordered()}.
ja: {@code sorted()}などのある種の中間処理は順序付けられていないストリームに出現順順序を導入する場合がある。一方で別の処理は順序付けられたストリームを順序付けられていない状態にする場合がある({@link java.util.stream.BaseStream#unordered()}など)。

source: Spliterator characteristics of the supplied {@code Spliterator.OfDouble}.
ja: 供給される{@code Spliterator.OfDouble}のスプリッテレータ特性

source: Spliterator characteristics of the supplied {@code Spliterator.OfInt}.
ja: 供給される{@code Spliterator.OfInt}のスプリッテレータ特性

source: Spliterator characteristics of the supplied {@code Spliterator.OfLong}.
ja: 供給される{@code Spliterator.OfLong}のスプリッテレータ特性

source: Spliterator characteristics of the supplied {@code Spliterator}.
ja: 供給される{@code Spliterator}のスプリッテレータ特性

source: Spliterators for mutable data sources have an additional challenge; timing of binding to the data, since the data could change between the time the spliterator is created and the time the stream pipeline is executed.
ja: 可変な情報源に対するスプリッテレータには他の課題がある。データを束縛するタイミングである。スプリッテレータが作成されてからストリームパイプラインが実行されるまでの間にデータが変化する可能性があるからだ。

source: Stateful operations may need to process the entire input before producing a result.
ja: 状態を持つ処理は結果を生成する前に全ての入力を処理する必要がある場合がある。

source: Stateful operations, such as {@code distinct} and {@code sorted}, may incorporate state from previously seen elements when processing new elements.
ja: {@code distinct}や{@code sorted}といった状態を持つ処理は、新しい要素を処理する際に前の要素に起因する状態を組み入れる場合がある。

source: Stateless behaviors
ja: 状態を持たない挙動

source: Stateless operations, such as {@code filter} and {@code map}, retain no state from previously seen element when processing a new element -- each element can be processed independently of operations on other elements.
ja: {@code filter}や{@code map}といった状態を持たない処理は、新しい要素を処理する際に前の要素に起因する状態を保持しない。各要素は他の要素に対する処理とは独立して処理できる。

source: Stream operations and pipelines
ja: ストリーム処理とパイプライン

source: Stream operations are divided into intermediate and terminal operations, and are combined to form stream pipelines.
ja: ストリーム処理は中間(intermediate)処理と末端(terminal)処理に分類でき、それらは組み合わされてパイプラインを形成する。

source: Stream operations are divided into intermediate ( {@code Stream}-producing) operations and terminal (value- or side-effect-producing) operations.
ja: ストリームに対する処理は中間処理(intermediate operation, {@code Stream}を生成する)と末端処理(terminal operation, 値か副作用生成する)に分けられる。

source: Stream pipeline results may be nondeterministic or incorrect if the behavioral parameters to the stream operations are stateful.
ja: ストリームパイプラインの結果は挙動パラメータが状態を持つ(stateful)は非決定的なものや間違ったものとなる場合がある。

source: Stream pipelines may execute either sequentially or in parallel.
ja: ストリームパイプラインは逐次的に実行される場合と並列に実行される場合がある。

source: Streams are created with an initial choice of sequential or parallel execution.
ja: ストリームは逐次実行か並列実行か選択されて作成される

source: Streams are lazy; computation on the source data is only performed when the terminal operation is initiated, and source elements are consumed only as needed.
ja: ストリームは遅延的(lazy)である。つまり情報源のデータに対する計算は末端処理が開始された際にのみ実行され、情報源の要素は必要になったときに消費される。

source: Streams based on spliterators with the desired characteristics, or those using the Supplier-based factory forms, are immune to modifications of the data source prior to commencement of the terminal operation (provided the behavioral parameters to the stream operations meet the required criteria for non-interference and statelessness).
ja: 要求された特性を持つスプリッテレータに基づくストリームや、Supplierに基づくファクトリ形式を使うストリームは、末端処理を開始する前になされたデータ源の変更に影響されない(挙動パラメータがが干渉的でなく、状態を持たないという条件を満たす場合)。

source: Streams can be obtained in a number of ways.
ja: ストリームは複数の方法で入手できる。

source: Streams differ from collections in several ways:
ja: ストリームとコレクションにはいくつか異なる点がある。

source: Streams enable you to execute possibly-parallel aggregate operations over a variety of data sources, including even non-thread-safe collections such as {@code ArrayList}.
ja: ストリームを使うと、{@code ArrayList}などのスレッド安全でないコレクションを含む様々なデータ源に対しても、並列な処理も含めた集計処理をできるようになる。

source: Streams facilitate parallel execution by reframing the computation as a pipeline of aggregate operations, rather than as imperative operations on each individual element.
ja: ストリームは計算を各要素に対する命令的な処理としてではなく集約処理のパイプラインとして捉え直すことで並列処理を容易にする。

source: Streams have a {@link #close()} method and implement {@link AutoCloseable}, but nearly all stream instances do not actually need to be closed after use.
ja: ストリームは{@link #close()}メソッドを持ち、{@link AutoCloseable}を実装するが、ほとんど全てのストリームのインスタンスは実際には利用後に閉じる必要はない。

source: Streams may or may not have a defined encounter order.
ja: ストリームは出現順順序(encounter order)を持っている場合と持っていない場合がある。

source: Streams of file paths can be obtained from methods in {@link java.nio.file.Files};
ja: ファイルパスのストリームは{@link java.nio.file.Files}の各メソッドから得られる。

source: Streams of random numbers can be obtained from {@link java.util.Random#ints()};
ja: 乱数のストリームは{@link java.util.Random#ints()}から得られる。

source: Such an implementation would do a great deal of string copying, and the run time would be O(n^2) in the number of characters.
ja: このような実装は大量の文字列コピーを実行し、実行時間は要素数に対してO(n^2)となるだろう。

source: Such parameters are always instances of a functional interface such as {@link java.util.function.Function}, and are often lambda expressions or method references.
ja: このようなパラメータは常に関数的インターフェース(functional interface)のインスタンスであり、多くの場合ラムダ式やメソッド参照である。

source: Sum, min, max, and average are all special cases of reduction.
ja: sum, min, max, averageは全て簡約の特別な場合である。

source: Sum, min, max, average, and string concatenation are all special cases of reduction.
ja: sum, min, max, average, 文字列連結は全て簡約の特別な場合である。

source: Summation is a special case of a reduction.
ja: 和は簡約の特別な場合である。

source: Summing a stream of numbers can be expressed as:
ja: 数値のストリームの合計は次のようにできる。

source: Suppose, however, that the result container used in this reduction was a concurrently modifiable collection -- such as a {@link java.util.concurrent.ConcurrentHashMap}.
ja: しかし、この簡約で使われる結果コンテナが{@link java.util.concurrent.ConcurrentHashMap ConcurrentHashMap}のように並行的に変更できるコレクションであったとしよう。

source: Terminal operations, such as {@code Stream.forEach} or {@code IntStream.sum}, may traverse the stream to produce a result or a side-effect.
ja: 末端処理はストリームを走査し、成果物を生成するか、副作用を発生させる。

source: That is, for a partially accumulated result {@code a} that is the result of any series of accumulator and combiner invocations, {@code a} must be equivalent to {@code combiner.apply(a, supplier.get())}.
ja: つまり、いくつかの累積と統合の結果である中間累積結果{@code a}に対して、{@code a}は{@code combiner.apply(a, supplier.get())}と等価である必要がある。

source: That is, for a partially accumulated result {@code p} that is the result of any series of accumulator and combiner invocations, {@code p} must be equivalent to {@code combiner.apply(p, supplier.get())}.
ja: つまり、いくつかの累積と統合の結果である{@code p}に対して、{@code p}は{@code combiner.apply(p, supplier.get())}と等価である必要がある。

source: That is, for any input elements {@code t1} and {@code t2}, the results {@code r1} and {@code r2} in the computation below must be equivalent:
ja: つまり、任意の入力{@code t1}と{@code t2}に対し、下記の計算における結果{@code r1}と{@code r2}は等価である必要がある。

source: The "widgets" examples shown earlier shows how reduction combines with other operations to replace for loops with bulk operations.
ja: 以前示した「ウィジェット」の例では、簡約を他の処理と組み合わせて、ループをバルク処理で置き換える様子を示した。

source: The accumulator function takes a partial result and the next element, and produces a new partial result.
ja: 累積関数(accumulator)は途中結果と次の要素を受けとり、新しい途中結果を生成する。

source: The combiner function combines two partial results to produce a new partial result.
ja: 統合関数(combiner)は2つの途中結果を統合して新しい途中結果を生成する

source: The above example for collecting strings into a {@code List} can be rewritten using a standard {@code Collector} as:
ja: 文字列を{@code List}に収集する上記の例は標準の{@code Collector}を使って次のように書き換えられる。

source: The accumulator function for the new collector
ja: 新しいコレクタの累積関数

source: The associativity constraint says that splitting the computation must produce an equivalent result.
ja: 結合性の制約では計算を分割しても等価な結果が生成さえることが定められている。

source: The average is a special case of a reduction.
ja: 平均は簡約の特別な場合である。

source: The average returned can vary depending upon the order in which values are recorded, due to accumulated rounding error in addition of values of differing magnitudes.
ja: 返される平均値は、桁が異なる値の加算に由来する丸め誤差の累積のため、値が登録される順番によって変化する場合がある。

source: The average returned can vary depending upon the order in which values are recorded.
ja: 返される和は要素が出現する順番によって変わる場合がある。

source: The behavior of this operation is explicitly nondeterministic.
ja: この処理の挙動は非決定的であると明示的に定められている。

source: The behavior of this operation is explicitly nondeterministic; it is free to select any element in the stream.
ja: この処理の動作は明示的に非決定的であり、どの要素を選んでもよい。

source: The best approach is to avoid stateful behavioral parameters to stream operations entirely; there is usually a way to restructure the stream pipeline to avoid statefulness.
ja: 最も良い方法はストリーム処理に対して状態を持つ挙動パラメータを完全に避けるという方法である。ストリームパイプラインにおいて状態を避けるように再編する方法が通常はある。

source: The built phase begins begins when the {@link #build()} method is called, which creates an ordered stream whose elements are the elements that were added to the stream builder, in the order they were added.
ja: 構築済段階は{@link #build()}メソッドが呼ばれた段階で開始し、{@link #build()}メソッドはこのストリームビルダに追加された要素を追加された順序で要素として持つ、順序を持つ{@code LongStream}を作成する。

source: The built phase begins when the {@link #build()} method is called, which creates an ordered stream whose elements are the elements that were added to the stream builder, in the order they were added.
ja: 構築済段階は{@link #build()}メソッドが呼ばれた段階で開始し、{@link #build()}メソッドはこのストリームビルダに追加された要素を追加された順序で要素として持つ、順序を持つ{@code IntStream}を作成する。

source: The built phase begins when the {@link #build()} method is called, which creates an ordered {@code Stream} whose elements are the elements that were added to the stream builder, in the order they were added.
ja: 構築済段階は{@link #build()}メソッドが呼ばれた段階で開始し、{@link #build()}メソッドはこのストリームビルダに追加された要素を追加された順序で要素として持つ、順序を持つ{@code Stream}を作成する。

source: The characteristics must be equal to {@code supplier.get().characteristics()}, otherwise undefined behavior may occur when terminal operation commences.
ja: この特性は{@code supplier.get().characteristics()}と等しい必要がある。そうでなければ末端処理開始した際に未定義動作となる可能性がある。

source: The class {@link Collectors} provides implementations of many common mutable reductions.
ja: {@link Collectors}クラスには多くの一般的な可変的簡約の実装が用意されている。

source: The class {@link java.util.stream.Collectors} contains a number of predefined factories for collectors, including combinators that transform one collector into another.
ja: {@link java.util.stream.Collectors}クラスにはコレクタのファクトリがいくつか予め用意されており、コレクタを他のコレクタに変換する結合子もある。

source: The class {@link java.util.stream.StreamSupport} has a number of low-level methods for creating a stream, all using some form of a {@link java.util.Spliterator}.
ja: {@link java.util.stream.StreamSupport}クラスはストリームを作るための低水準なメソッドを備えており、それらは全てなんらかの形の{@link java.util.Spliterator}を利用している。

source: The classes {@link java.util.stream.Stream}, {@link java.util.stream.IntStream}, {@link java.util.stream.LongStream}, and {@link java.util.stream.DoubleStream} are streams over objects and the primitive {@code int}, {@code long} and {@code double} types.
ja: クラス{@code Stream}, {@link java.util.stream.IntStream}, {@link java.util.stream.LongStream}, {@link java.util.stream.DoubleStream}はオブジェクトおよびプリミティブ型{@code int}, {@code long}, {@code double}のストリームである。

source: The classification function maps elements to some key type {@code K}.
ja: 分類関数は要素を{@code K}型の何らかのキーに写像する。

source: The collector characteristics for the new collector
ja: 新しいコレクタが備えるコレクタ特製

source: The collector has the {@link java.util.stream.Collector.Characteristics#CONCURRENT} characteristic, and;
ja: コレクタが{@link java.util.stream.Collector.Characteristics#CONCURRENT}特性を持つ。

source: The collector produces a {@code ConcurrentMap<K, List<T>>} whose keys are the values resulting from applying the classification function to the input elements, and whose corresponding values are {@code List}s containing the input elements which map to the associated key under the classification function.
ja: このコレクタは、入力要素に分類関数を適用した結果の値をキーとして持ち、そのキーに分類関数が写像するような入力要素を含む{@code List}を対応する値として持つような{@code ConcurrentMap<K, List<T>>}を生成する。

source: The collector produces a {@code Map<K, List<T>>} whose keys are the values resulting from applying the classification function to the input elements, and whose corresponding values are {@code List}s containing the input elements which map to the associated key under the classification function.
ja: このコレクタは、入力要素に分類関数を適用した結果の値をキーとして持ち、そのキーに分類関数が写像するような入力要素を含む{@code List}を対応する値として持つような{@code Map<K, List<T>>}を生成する。

source: The combiner function for the new collector
ja: 新しいコレクタの統合関数

source: The combiner function may fold state from one argument into the other and return that, or may return a new result container.
ja: 統合関数は片方の引数をもう片方に折り畳んでそれを返してもよいし、新しい結果オブジェクトを返してもよい。

source: The default implementation behaves as if:
ja: デフォルト実装は次のように振る舞う。

source: The downstream collector operates on elements of type {@code T} and produces a result of type {@code D}.
ja: 下流のコレクタは{@code T}型の要素を処理し、{@code D}型の結果を返す。

source: The element type of the new stream
ja: 新しいストリーム要素の型

source: The elements are compared for equality according to {@link java.lang.Double#compare(double, double)}.
ja: 要素は{@link java.lang.Double#compare(double, double)}に従って比較される。

source: The elements of a stream are only visited once during the life of a stream.
ja: ストリームの各要素は、ストリームが有効である間にそれぞれ1回だけ処理される。

source: The final result type of the new collector
ja: 新しいコレクタの最終結果型

source: The finisher function for the new collector
ja: 新しいコレクタの仕上げ関数

source: The first argument passed to the accumulator function, both arguments passed to the combiner function, and the argument passed to the finisher function must be the result of a previous invocation of the result supplier, accumulator, or combiner functions.
ja: 累積関数に与えられる第1引数と、統合関数に与えられる両方の引数は、供給関数や累積関数や統合関数に対する以前の呼び出しの結果である必要がある。

source: The first element (position {@code 0}) in the {@code DoubleStream} will be the provided {@code seed}.
ja: {@code DoubleStream}の最初の要素(位置{@code 0})は{@code seed}によって与えられる。

source: The first element (position {@code 0}) in the {@code IntStream} will be the provided {@code seed}.
ja: {@code IntStream}の最初の要素(位置{@code 0})は{@code seed}によって与えられる。

source: The first element (position {@code 0}) in the {@code LongStream} will be the provided {@code seed}.
ja: {@code LongStream}の最初の要素(位置{@code 0})は{@code seed}によって与えられる。

source: The first element (position {@code 0}) in the {@code Stream} will be the provided {@code seed}.
ja: {@code Stream}の最初の要素(位置{@code 0})は{@code seed}によって与えられる。

source: The following are examples of using the predefined collectors to perform common mutable reduction tasks:
ja: 次のコードは予め用意されたコレクタを使ってよくある可変簡約作業をする例である。

source: The following example illustrates an aggregate operation using the stream types {@link Stream} and {@link IntStream}, computing the sum of the weights of the red widgets:
ja: 次の例は{@link Stream}型と{@link IntStream}型のストリームを使った集計処理を示し、赤いウィジェットの重さの和を計算する。

source: The following example illustrates an aggregate operation using {@link Stream} and {@link DoubleStream}, computing the sum of the weights of the red widgets:
ja: 次の例は{@link Stream}と{@link DoubleStream}を使った集計処理を示し、赤いウィジェットの重さの和を計算する。

source: The following example illustrates an aggregate operation using {@link Stream} and {@link IntStream}, computing the sum of the weights of the red widgets:
ja: 次の例は{@link Stream}と{@link IntStream}を使った集計処理を示し、赤いウィジェットの重さの和を計算する。

source: The following example illustrates an aggregate operation using {@link Stream} and {@link IntStream}:
ja: 次の例は{@link Stream}と{@link IntStream}を使った集計処理を示す。

source: The following example illustrates an aggregate operation using {@link Stream} and {@link LongStream}, computing the sum of the weights of the red widgets:
ja: 次の例は{@link Stream}と{@link LongStream}を使った集計処理を示し、赤いウィジェットの重さの和を計算する

source: The following will accumulate strings into an ArrayList:
ja: 以下のコードは文字列をArrayListに累積する。

source: The following will classify {@code Person} objects by city:
ja: 以下のコードは{@code Person}オブジェクトを都市によって分類する。

source: The following will classify {@code Person} objects by state and city, cascading two {@code Collector}s together:
ja: 以下のコードは2つの{@code Collector}を共にカスケードして、{@code Person}オブジェクトを州と都市によって分類する。

source: The following will take a stream of strings and concatenates them into a single string:
ja: 次のコードは文字列のストリームを取り、1つの文字列に連結する。

source: The form of this is very similar to the general form of ordinary reduction:
ja: この形式は通常の簡約の一般的な形式とよく似ている。

source: The generalized form is provided for cases where significant work can be optimized away by combining mapping and reducing into a single function.
ja: 一般的な形式は写像と簡約を1つの関数へ統合すると多くの処理が最適化によって取り除ける場合のために用意されている。

source: The generator function takes an integer, which is the size of the desired array, and produces an array of the desired size.
ja: 生成関数は望む配列の大きさである整数を受けとり、望む大きさの配列を生成する。

source: The identity constraint says that for any partially accumulated result, combining it with an empty result container must produce an equivalent result.
ja: 単位元の制約では中間累積結果に対して空の結果コンテナを統合しても等価な結果が生成されることが定められている。

source: The implementation should not do anything with the result of any of the result supplier, accumulator, or combiner functions other than to pass them again to the accumulator, combiner, or finisher functions, or return them to the caller of the reduction operation.
ja: 実装は、供給関数・累積関数・統合関数の結果に対して、累積関数や統合関数や仕上げ関数に再び渡すか簡約処理の呼び出し側へ返すか以外してはいけない。

source: The importance of this to parallel evaluation can be seen if we expand this to four terms:
ja: 並列評価におけるこの性質の重要性はこれを次の4つの式の場合に拡大するとわかる。

source: The intermediate accumulation type of the new collector
ja: 新しいコレクタの中間累積型

source: The key abstraction introduced in this package is stream.
ja: このパッケージで導入するキーとなるインターフェースはストリームである。

source: The lines of a file can be obtained from {@link java.io.BufferedReader#lines()};
ja: ファイルの各行は{@link java.io.BufferedReader#lines()}で得られる。

source: The maximum element will be {@code Double.NaN} if any stream element was NaN.
ja: もしストリームのいずれかの要素がNaNであれば、最大要素は{@code Double.NaN}となる。

source: The minimum element will be {@code Double.NaN} if any stream element was NaN.
ja: もしストリームのいずれかの要素がNaNであれば、最小要素は{@code Double.NaN}となる。

source: The mutable reduction operation is called {@link java.util.stream.Stream#collect(Collector) collect()}, as it collects together the desired results into a result container such as a {@code Collection}.
ja: 可変的簡約処理は{@code Collection}のような結果コンテナに望む結果を収集(collect)していくため、{@link java.util.stream.Stream#collect(Collector) collect()}と呼ばれる。

source: The need for non-interference applies to all pipelines, not just parallel ones.
ja: 非干渉性は並列なパイプラインだけでなく、全てのパイプラインに対して求められる。

source: The notable exception to this are streams whose sources are concurrent collections, which are specifically designed to handle concurrent modification.
ja: これに対する重要な例外は情報源が並行的(concurrent)な変更を扱うように特別に設計された並行コレクションであるようなストリームである。

source: The only difference between the serial and parallel versions of this example is the creation of the initial stream, using " {@code parallelStream()}" instead of " {@code stream()}".
ja: この例における逐次版と並列版の唯一の違いは最初のストリームを「{@code stream()}」ではなく「{@code parallelStream()}」で生成した点である。

source: The order of addition operations of this method is intentionally not defined to allow for implementation flexibility to improve the speed and accuracy of the computed result.
ja: このメソッドにおける加算の順序は実装が柔軟に計算結果の速度と精度を改善できるようあえて定義されていない。

source: The other forms of {@code toConcurrentMap} simply use a merge function that throws unconditionally, but you can easily write more flexible merge policies.
ja: 他の形式の{@code toConcurrentMap}は単純に無条件に例外を投げる併合関数を使うが、より柔軟な併合方針も書ける。

source: The other forms of {@code toMap} simply use a merge function that throws unconditionally, but you can easily write more flexible merge policies.
ja: 他の形式の{@code toMap}は単純に無条件に例外を投げる併合関数を使うが、より柔軟な併合方針も書ける。

source: The reduction implementation must manage that the input is properly partitioned, that partitions are processed in isolation, and combining happens only after accumulation is complete.
ja: 簡約の実装は、入力が重なりを持たずに分割され、分割処理は他の処理から分離して進行され、統合処理は累積処理が完了した後にのみ起きるようにやりくりする必要がある。

source: The result is described as an {@code Optional<T>}.
ja: 結果は{@code Optional<T>}によって表される。

source: The resulting collector produces a {@code Map<K, D>}.
ja: 結果のコレクタは{@code Map<K, D>}を生成する。

source: The resulting stream is ordered if both of the input streams are ordered, and parallel if either of the input streams is parallel.
ja: 結果のストリームは両方の入力ストリームが順序を持ては順序を持ち、どちらかの入力ストリームが並列であれば並列である。
